Revit 2027 API
ElectricalEquipment.GetCircuitNamingSchemeType Method
 Gets enumerated type of the circuit naming scheme used with Electrical Equipment.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CircuitNaming GetCircuitNamingSchemeType()
Public Function GetCircuitNamingSchemeType As CircuitNaming
public:
CircuitNaming GetCircuitNamingSchemeType()
member GetCircuitNamingSchemeType : unit -> CircuitNaming
Return Value
CircuitNaming
 The enumerated type of circuit naming scheme.
See Also
Reference
ElectricalEquipment Class
Autodesk.Revit.DB.Electrical Namespace